$(function(){
            function objInit(obj){
                return $(obj).html('<option>请选择</option>');
            }
            function judgeObj(obj, txt) {
                var a = 0;
                $(obj).each(function () {
                    var list = $(this).text();
                    if (list == txt){
                        a += 1
                    }else{
                        a += 0
                    }
                });
                return a;
            }
            var arrData=[{"dealer":"武汉森美石化制品有限公司","province":"湖北","city":"省直辖 ","district":"仙桃市","address":"仙桃市华强润滑油专店湖北省仙桃市宏达路（仙桃质量技术监督局对面）仙桃, HU 433000","phone":"15871914707"},
                {"dealer":"浙江全盛孚化工有限公司","province":"浙江","city":"杭州市","district":"余杭区","address":"浙江省杭州余杭长运汽车修理厂小车维修部浙江省杭州市余杭区新长途车站内杭州, ZJ 310000","phone":"0571-89050909"},
                {"dealer":"佛山市南海区大沥置达润滑油有限公司","province":"广东","city":"佛山市","district":"南海区","address":"广东省佛山市南海区黄岐车海汽车维修美容中心广东省佛山市南海区大沥镇黄岐勃海路北村段佛山, GD 528428","phone":"0757-85938575"},
                {"dealer":"肇庆市新恒捷贸易有限公司","province":"广东","city":"清远市","district":"英德市","address":"英德市广龙—站式汽车美容服务部广东省清远英德市茶园中路清泉汽车装饰城内（即南海大酒店背后）清远, GD 513000","phone":"0763-2287267"},
                {"dealer":"南宁市东科经贸有限责任公司","province":"广西壮族自治区","city":"南宁市","district":"兴宁区","address":"南宁市建林汽车用品有限公司南宁市兴旺路1-105号南宁, GX 530001","phone":"18607711248"},
                {"dealer":"哈尔滨华隆伟业经贸有限公司","province":"黑龙江","city":"哈尔滨市","district":"南岗区","address":"明宇兄弟汽车维修服务中心黑龙江省哈尔滨市南岗区宣化街329号哈尔滨, HL 150001","phone":"0451-82731111"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"青岛市","district":"四方区","address":"山东省青岛运泰汽车零部件有限公司山东省青岛市四方区长沙路86-5-7号青岛, SD 266000","phone":"0532-82077377"},
                {"dealer":"巴州美联四运石油化工产品有限责任公司","province":"新疆维吾尔自治区","city":"巴音郭楞蒙古自治州","district":"库尔勒市","address":"新疆库尔勒美联四运美孚1号汽车养护中心新疆库尔勒市铁门关路库尔勒, XJ 841000","phone":"0996-2297363"},
                {"dealer":"汕头市恒孚贸易有限公司","province":"广东","city":"潮州市","district":"潮安县","address":"潮安县圆盛汽车服务维修中心广东省潮州市潮安县彩塘大寨站礼德加油站旁潮州, GD 521000","phone":"0768-5632590"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"寮步镇","address":"东莞市爱车营汽车服务有限公司广东省东莞市竂步镇香市路东孚大厦首层东莞, GD 523407","phone":"0769-82316333"},
                {"dealer":"汕头市恒孚贸易有限公司","province":"广东","city":"汕头市","district":"潮阳区","address":"汕头市澄海裕华汽车服务部 薪兴汽车服务中心广东省汕头市澄海区德政路澄江花园46号汕头, GD 515800","phone":"0754-87917900"},
                {"dealer":"北京市安惠汽车配件有限公司","province":"北京","city":"北京市","district":"朝阳区","address":"北京市吉安特汽车服务中心北京朝阳区安外北苑红军营南路亿客隆市场旁北京, BJ 100012","phone":"13501191825"},
                {"dealer":"北京瑞兆呈祥商贸有限公司","province":"北京","city":"北京市","district":"海淀区","address":"北京远驰进口汽车修理厂北京市海淀区香山南路红旗村甲2号北京, BJ 100093","phone":"010-62595325"},
                {"dealer":"山西超力贸易有限公司","province":"山西","city":"长治市","district":"城区","address":"山西省长治市华锐上众汽车维修有限公司山西省长治市太行南路38号泰舸汽贸园东入口200米长治, SA 46011","phone":"0355-2127827"},
                {"dealer":"天津市泰拓科工贸有限公司","province":"天津","city":"天津市","district":"北辰区","address":"天津中天军达汽车维修服务有限公司天津市北辰区天穆顺义道二建对面天津, TJ 300400","phone":"022-26340877"},
                {"dealer":"贰仟家汽车服务股份有限公司","province":"河南","city":"郑州市","district":"登封市","address":"河南省登封市裕达商贸有限公司河南省登封市东少林路东段市标东200米路南登封, HE 475000","phone":"0371-62863328"},
                {"dealer":"河南福孚石化贸易有限公司","province":"河南","city":"信阳市","district":"浉河区","address":"信阳键源新动力汽车服务中心1号店河南省信阳市浉河区湖东大道与五星路交叉口贸易广场118号信阳, HE 464000","phone":"0376-6553839"},
                {"dealer":"武汉森美石化制品有限公司","province":"湖北","city":"荆州市","district":"监利县","address":"骥德汽车服务换油中心湖北省监利县江城路唐人街酒店门面江城路54号荆州, HU 433300","phone":"0716-3324777"},
                {"dealer":"浙江全盛孚化工有限公司","province":"浙江","city":"杭州市","district":"上城区","address":"浙江省杭州大可汽车维护装饰有限公司杭州市清江路316号杭州, ZJ 310000","phone":"0571-86555204"},
                {"dealer":"福州嘉瑞源商贸有限公司","province":"福建","city":"福州市","district":"鼓楼区","address":"福州九龙胜汽车维修服务中心福建省福州市鼓楼区西二环梦山北路福州, FJ 350001","phone":"0591-83751777"},
                {"dealer":"泉州美联贸易有限公司","province":"福建","city":"泉州市","district":"晋江市","address":"泉州晋江英林车博士汽车俱乐部福建省晋江市英林镇英伍路劲霸经编厂旁边晋江, FJ 362256","phone":"0595-85491088"},
                {"dealer":"泉州美联贸易有限公司","province":"福建","city":"泉州市","district":"丰泽区","address":"泉州宝洲高级轿车维修有限公司泉州宝洲路泉州, FJ 362300","phone":"0595-22538558"},
                {"dealer":"佛山市南海区大沥置达润滑油有限公司","province":"广东","city":"佛山市","district":"南海区","address":"佛山市南海区松岗联表乐其汽车清洗店广东省佛山南海松岗联表石碣路口对面佛山, GD 528234","phone":"0757-85229896"},
                {"dealer":"佛山市顺德区容桂新达商贸有限公司","province":"广东","city":"佛山市","district":"禅城区","address":"佛山市旭建汽车服务有限公司广东省佛山市玫瑰西路3-5号佛山, GD 528000","phone":"0757-83323199"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"增城区","address":"广东省广州增城创意汽车美容广东省广州市荔城街荔景大道中枢名门9-11号首层增城, GD 511340","phone":"020-82629330"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"浦东新区","address":"上海市浦东新区洋泾街道天吉汽车配件维修部上海市巨野路168号上海, SH 200135","phone":"021-68539605"},
                {"dealer":"宁夏立伟商贸有限公司","province":"宁夏回族自治区","city":"银川市","district":"金凤区","address":"宁夏旅发进口汽车维修厂银川市高新技术开发区（经五路与纬十六路路口）银川, NX 750001","phone":"0951-5024744"},
                {"dealer":"汕头市恒孚贸易有限公司","province":"广东","city":"汕头市","district":"潮阳区","address":"潮阳峡和汽车修配厂潮阳和平镇和惠路口（往惠来方向直行到看到路标往左）汕头, GD 515154","phone":"13822800001"},
                {"dealer":"汕头市恒孚贸易有限公司","province":"广东","city":"汕头市","district":"潮阳区","address":"广东省汕头市春发修配厂广东省汕头市潮阳区国道324陈店溪口路段（即华港大道路口旁）汕头, GD 515100","phone":"0754-87882222"},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"龙岗区","address":"广东省深圳市龙岗区平安汽车清洁护理服务部广东省深圳市龙岗区龙城龙福路城龙花园4栋1-3号深圳, GD 518000","phone":"0755-89918758"},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"福田区","address":"广东省深圳市福田区深之保汽车美容中心福田区梅林路上梅林文体中心W1-2、W1-1深圳, GD 518049","phone":"0755-83316186"},
                {"dealer":"内蒙古海隆润滑技术有限责任公司","province":"内蒙古自治区","city":"乌兰察布市","district":"集宁区","address":"内蒙古乌兰察布市美孚润滑油换油中心乌兰察布市集宁区新体路小学东100米乌兰察布, NM 12000","phone":"0474-8250398"},
                {"dealer":"唐山金万利商贸有限公司","province":"河北","city":"唐山市","district":"滦县","address":"唐山市滦县万事达汽车修理厂河北省唐山市滦县新城立交桥北平青大路唐山, HB 63300","phone":"0315-7125059"},
                {"dealer":"徐水县长青商贸有限公司","province":"河北","city":"保定市","district":"徐水县","address":"河北省徐水县长青商贸有限公司河北省徐水县康明南路保定, HB 72550","phone":"0312-8616666"},
                {"dealer":"宁波市华达石化有限公司","province":"浙江","city":"宁波市","district":"鄞州区","address":"浙江省宁波市诚一汽车维修装璜美容服务中心宁波市鄞州区横溪镇人民路（新农行对面）宁波, ZJ 315000","phone":"0574-88474726"},
                {"dealer":"温州强润石化有限公司","province":"浙江","city":"温州市","district":"乐清市","address":"乐清市丰驰汽车维修服务中心乐清市北白象镇交通西路363-383号乐清, ZJ 325000","phone":"#N/A"},
                {"dealer":"泉州美联贸易有限公司","province":"福建","city":"泉州市","district":"晋江市","address":"福建省晋江市安海捷成汽车修理厂福建省晋江市安海镇汽车站内晋江, FJ 362261","phone":"0595-85757899"},
                {"dealer":"珠海经济特区威盛贸易有限公司","province":"广东","city":"江门市","district":"蓬江区","address":"江门市安捷汽车维修保养广东省江门市环市一路17号江门, GD 529000","phone":"0750-3231333"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"荔湾区","address":"广州市铁军汽车美容服务部广东省广州市荔湾区流花路61号广州, GD 510160","phone":"020-86664584"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"白云区","address":"广东省广州市白云区同和飞驰汽车美容服务部广东省广州市白云区京溪沙太路军医大学东院小区C栋8-10广州, GD 510515","phone":"020-61360932"},
                {"dealer":"肇庆市新恒捷贸易有限公司","province":"广东","city":"肇庆市","district":"封开县","address":"封开县江口镇协力汽车维修中心广东省肇庆市封开县江口镇封洲二路肇庆, GD 526040","phone":"0758-6663934"},
                {"dealer":"珠海经济特区威盛贸易有限公司","province":"广东","city":"珠海市","district":"香洲区","address":"珠海市力博汽车美容中心珠海市香洲长环新村24栋之二（迎宾北路长环新村路口）珠海, GD 519000","phone":"0756-2299455, 0756-2295534"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"金山区","address":"上海市雍业汽车养护中心宝山店上海市宝山区宝杨路583号上海, SH 201900","phone":"13311811100"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"吉林市","district":"昌邑区","address":"吉林市昌邑区沿江润滑油商行吉林市解放东路东昌小区27号楼27号网点吉林, JL 132011","phone":"0432-62447833"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"长春市","district":"朝阳区","address":"吉林省长春市江滨汽车服务有限公司吉林省长春市开运街90号长春, JL 130021","phone":"0431-85928510"},
                {"dealer":"大庆市亚华龙润滑油经销有限公司","province":"黑龙江","city":"齐齐哈尔市","district":"龙沙区","address":"黑龙江省齐齐哈尔亚华龙润滑油商行黑龙江省齐齐哈尔市南马路194号齐齐哈尔, HL 161000","phone":"0452-2210111"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"东城区","address":"东莞市爱车营汽车服务有限公司（东城店）广东省东莞市东城区东升路钱屋街1号东莞, GD 523000","phone":"13922536683"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"大岭山镇","address":"东莞市车王会汽车维修服务有限公司广东省东莞市大岭山镇教育路地税局对面东莞, GD 523000","phone":"13450608888"},
                {"dealer":"唐山金万利商贸有限公司","province":"河北","city":"唐山市","district":"遵化市","address":"遵化市山源汽车修理有限公司河北省遵化市文化北路新汽车站北行200米路西遵化, HB 64200","phone":"0315-6077000"},
                {"dealer":"武汉厚诚贸易有限公司","province":"湖北","city":"武汉市","district":"汉阳区","address":"武汉迪美汽车维修服务有限公司湖北省武汉市汉阳区墨水湖北路104号武汉, HU 430000","phone":"027-84669919"},
                {"dealer":"贰仟家汽车服务股份有限公司","province":"河南","city":"郑州市","district":"金水区","address":"郑州一帆汽车售后服务部（天荣店）河南省郑州市花园北路天荣汽车城A12-78（天荣国际建材港北区）郑州, HE 450045","phone":"13838288325"},
                {"dealer":"衢州鼎润贸易有限公司","province":"浙江","city":"衢州市","district":"衢江区","address":"衢州南港汽车维修服务有限公司衢州市衢江区滨港中路11号衢州, ZJ 324000","phone":"0570-3375719"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"海珠区","address":"广州市恒基汽车维修服务有限公司广东省广州市海珠区昌岗中路128号广州, GD 510250","phone":"020-84363101 "},
                {"dealer":"苏州新天宇润滑油有限公司","province":"江苏","city":"苏州市","district":"吴江区","address":"日盛车业-汽车一站式服务中心江苏省苏州市园区跨塘镇跨阳路(联发装饰城南侧)苏州, JS 215000","phone":"13806214999"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"浦东新区","address":"上海繁博汽车装潢有限公司上海市浦东新区乐园路51号上海, SH 201206","phone":"13061631973"},
                {"dealer":"大庆市亚华龙润滑油经销有限公司","province":"黑龙江","city":"大庆市","district":"让胡路区","address":"亚华龙润滑油公司大庆市让湖路区未来城13-7号大庆, HL 163458","phone":"13019076123"},
                {"dealer":"沈阳永兴泰贸易有限公司","province":"辽宁","city":"抚顺市","district":"顺城区","address":"抚顺市兴盛达汽车服务有限公司抚顺市顺城区新城路西段同济开发楼107号抚顺, LN 113100","phone":"13841332222"},
                {"dealer":"本溪海纳商贸有限公司","province":"辽宁","city":"本溪市","district":"平山区","address":"本溪市平山区惠溪汽车服务中心本溪市平山区新德街（转山加油站左侧）本溪, LN 117000","phone":"024-42347899"},
                {"dealer":"本溪海纳商贸有限公司","province":"辽宁","city":"鞍山市","district":"铁东区","address":"鞍山市铁东区惠溪汽车服务中心鞍山市铁东区矿工路36号（长青转盘南100米）鞍山, LN 114001","phone":"0412-5655277"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"大理白族自治州","district":"大理市","address":"恒鑫源汽车修理店云南省大理市下关环城南路宏祥酒店对面9753号大理, YN 0","phone":"13577220680"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"昆明市","district":"盘龙区","address":"昆明宏升汽车维修有限公司云南省昆明市盘龙区白龙寺314号附2#昆明, YN 0","phone":"13888318400"},
                {"dealer":"青海新孚商贸有限公司","province":"青海","city":"西宁市","district":"城北区","address":"西宁城北润青汽车保养维护部青海省西宁市城北区柴达木路53号西宁, QH 810000","phone":"18997070777"},
                {"dealer":"四川鼎力石化有限公司","province":"四川","city":"宜宾市","district":"筠连县","address":"筠连县銘锋汽车服务有限公司四川省宜宾筠连县廉溪星星三组宜宾, SC 0","phone":"0838-6666266"},
                {"dealer":"贰仟家汽车服务股份有限公司","province":"河南","city":"开封市","district":"0","address":"开封精英汽车修配有限公司2号店河南省开封市黄河路南段（京西宾馆南500米路东）开封, HE 475001","phone":"13903789932"},
                {"dealer":"陕西易源石化有限责任公司","province":"陕西","city":"汉中","district":"0","address":"汉中市唐龙汽车维修有限责任公司汉中市朝阳北路中段(新开的路无门牌)汉中, SX 723000","phone":"0916-2229990"},
                {"dealer":"阳江市国基贸易有限公司","province":"广东","city":"阳江市","district":"江城区","address":"广东省阳江市国基汽车养护中心广东省阳江市建设一路邮政局北侧阳江, GD 529500","phone":"0662-3652888"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"楚雄彝族自治州","district":"楚雄市","address":"楚雄骏达车友会所楚雄市经济开发区永宁街65#楚雄, YN 0","phone":"0878-6110089"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"曲靖市","district":"麒麟区","address":"曲靖旭成汽车服务部曲靖市三江大道飞马汽配城D区1-9号曲靖, YN 0","phone":"0874-3148465"},
                {"dealer":"巴州美联四运石油化工产品有限责任公司","province":"新疆维吾尔自治区","city":"阿克苏地区","district":"阿克苏市","address":"阿克苏润宝汽车服务有限公司阿克苏市乌喀路都市怡景花园3#门面房阿克苏, XJ 843000","phone":"0997-2591505"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"奉贤区","address":"浦博汽车服务有限公司西渡分公司奉贤区南渡镇扶栏路113号上海, SH 0","phone":"13601824191"},
                {"dealer":"四川鼎力石化有限公司","province":"四川","city":"成都市","district":"武侯区","address":"成都捷辉汽车服务有限公司成都市武青北路76号1栋1楼5号成都, SC 0","phone":"028-87087650"},
                {"dealer":"广州市强骏贸易有限公司","province":"广东","city":"广州市","district":"白云区","address":"广州市金燕汽车配件经营部广东省广州市白云区粤墾路108-110号广州, GD 510507","phone":"020-87291175"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"横沥镇","address":"东莞市平安汽车维修服务有限公司广东省东莞市横沥镇振兴西路东莞, GD 523000","phone":"0769-83733333"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"松江区","address":"上海平利汽车美容快修店明兴路673-675上海, SH 201318","phone":"15800601380"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"浦东新区","address":"上海灵山汽车维修有限公司灵山路1192号上海, SH 0","phone":"021-5833178"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"凤岗镇","address":"东莞市凤岗立顺盈汽车维修服务中心广东省东莞市 凤岗大岭工业区大岭路16号东莞, GD 523000","phone":"0769-87755853 "},
                {"dealer":"新疆青松石油化工有限责任公司","province":"新疆维吾尔自治区","city":"乌鲁木齐市","district":"水磨沟区","address":"乌鲁木齐青松铭越汽车护理部乌鲁木齐市水磨沟区昆仑东街208号乌鲁木齐, XJ 830000","phone":"0991-4885052"},
                {"dealer":"四川鼎力石化有限公司","province":"四川","city":"眉山市","district":"东坡区","address":"四川新鑫和信汽车服务有限公司四川眉山东坡区裴城路金罗马广场成都, SC 610200","phone":"028-38077877"},
                {"dealer":"本溪海纳商贸有限公司","province":"辽宁","city":"本溪市","district":"明山区","address":"本溪市明山区惠溪汽车服务中心本溪市明山区文化路山水人家B区3#楼临街公建本溪, LN 117000","phone":"024-43840555"},
                {"dealer":"银川市宇成商贸有限公司","province":"宁夏回族自治区","city":"银川市","district":"金凤区","address":"宁夏新银通汽车服务有限公司银川市长城中路211号银川, NX 750001","phone":"0951-5050888"},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"龙岗区","address":"深圳市坪山新区新丰汽车修理厂广东省深圳市坪山新区坑梓秀新社区第三工业区宝梓北路51号深圳, GD 518000","phone":"0755-84138833"},
                {"dealer":"石家庄市冀中众力汽车贸易有限公司","province":"河北","city":"石家庄市","district":"桥西区","address":"石家庄市冀中汽车服务有限公司石家庄市桥西区西二环南路182号石家庄, HB 50091","phone":"0311-83818265"},
                {"dealer":"山西超力贸易有限公司","province":"山西","city":"太原市","district":"小店区","address":"山西超力贸易有限公司山西省太原市小店区学府街12号太原, SA 30006","phone":"0351-4296899"},
                {"dealer":"山东省裕明商贸有限公司","province":"山东","city":"德州","district":"开发","address":"德州徐记汽车维修有限公司山东省德州市东方红东路1711号德州, SD 250012","phone":"0534-5081854"},
                {"dealer":"重庆新星海贸易有限公司","province":"重庆","city":"重庆市","district":"渝北区","address":"嘉腾龙德汽车一站式服务重庆市渝北区冉家坝龙山路197号重庆, CQ 400700","phone":"023-67794461"},
                {"dealer":"徐水县长青商贸有限公司","province":"河北","city":"衡水市","district":"桃城区","address":"衡水市桃城区鑫凌晟汽车配件经销处河北省衡水市桃城区中华大街888号衡水, HB 53000","phone":"0318-6011589 "},
                {"dealer":"包头市蒙泰物贸有限责任公司","province":"内蒙古自治区","city":"包头市","district":"昆都仑区","address":"包头昆区天利车之家汽车快修店包头市昆区白云路与鞍山道中段路北（团结大街）包头, NM 14010","phone":"0472-2116699"},
                {"dealer":"宁波市华达石化有限公司","province":"浙江","city":"宁波市","district":"鄞州区","address":"宁波亚军汽车维修服务宁波市鄞州嵩江东路155号（军供站下面）宁波, ZJ 315100","phone":"0574-83050059"},
                {"dealer":"山东省裕明商贸有限公司","province":"山东","city":"聊城市","district":"东昌府区","address":"聊城洪光汽修厂山东省聊城市鲁化路37号，振兴路与鲁化路交叉口向北100米路东聊城, SD 252000","phone":"0635-8809618"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"黄埔区","address":"华骏汽车养护店广东省广州市黄埔区护林路69号广州, GD 510000","phone":"020-82323035"},
                {"dealer":"内蒙古海隆润滑技术有限责任公司","province":"内蒙古自治区","city":"鄂尔多斯市","district":"准格尔旗","address":"驰中宝汽车服务中心准格尔市薛家湾区开源路准格尔, NM 10300","phone":"0477-4820678"},
                {"dealer":"北京瑞兆呈祥商贸有限公司","province":"北京","city":"北京市","district":"海淀区","address":"北京盛景汽车服务中心北京市海淀区清河西小口87号院1号楼一层北京, BJ 100096","phone":"13910672541"},
                {"dealer":"汕头市恒孚贸易有限公司","province":"广东","city":"汕头市","district":"潮南区","address":"潮阳忠诚汽车维修中心广东省汕头市潮南区司马浦镇港口路(司马浦医院路口)汕头, GD 515149","phone":"0754-87710133"},
                {"dealer":"贰仟家汽车服务股份有限公司","province":"河南","city":"郑州市","district":"管城回族区","address":"河南省鑫联年丰车辆修理有限公司河南省郑州市未来路与白堤路交叉口向东300米(国香茶城北门)郑州, HE 450000","phone":"0371-66897728"},
                {"dealer":"天津市汇高世纪商贸有限公司","province":"天津","city":"天津市","district":"河东区","address":"天津市河东区晓潘汽车维修养护中心天津市河东区向阳楼建新路3号天津, TJ 300161","phone":"022-24591018 "},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"宝山区","address":"上海旺童辉汽车维修有限公司沙浦路280号上海, SH 0","phone":"021-36071887"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"青岛市","district":"黄岛区","address":"青岛经济开发区荣泰汽车维护服务中心青岛经济开发区保税路青岛, SD 266555","phone":"13386483892"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"青岛市","district":"市南区","address":"青岛嘉东利汽车用品有限公司青岛闽江路1号青岛, SD 266000","phone":"13906395957"},
                {"dealer":"西藏利通商贸有限公司","province":"西藏自治区","city":"拉萨市","district":"堆龙德庆县","address":"西藏利通车养护西藏人和汽配汽贸市场9号楼4-001号商铺（人和汽贸城西门）拉萨, XZ 850000","phone":"13308909966"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"昆明市","district":"北市区","address":"昆明市成骥超赛汽车养护中心云南昆明市北市区红园路701-713昆明, YN 650224","phone":"#N/A"},
                {"dealer":"温州强润石化有限公司","province":"浙江","city":"温州市","district":"龙湾区","address":"顺捷汽车维修中心温州市龙湾区机场大道627号（蓝田牌坊对面）温州, ZJ 325000","phone":"0577-86899968  "},
                {"dealer":"徐水县长青商贸有限公司","province":"河北","city":"保定市","district":"容城县","address":"容城县新动力汽车养护中心保定市容城县东环路保定, HB 71000","phone":"0312-5556788 "},
                {"dealer":"陕西易源石化有限责任公司","province":"陕西","city":"西安市","district":"未央区","address":"陕西易源汽车服务陕西西安纬26街51号西安, SX 710400","phone":"029-86280981"},
                {"dealer":"佛山市南海区大沥置达润滑油有限公司","province":"广东","city":"佛山市","district":"南海区","address":"佛山市南海桂城东二永恒汽车修配厂佛山市南海区桂城东二大道工业区中段佛山, GD 528000","phone":"0757-86391681"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"花都区","address":"拓凯尔汽车服务有限公司广东省广州市花都区新华街天贵路73号E栋01铺广州, GD 510000","phone":"020-86856822"},
                {"dealer":"金华市顺力石油化工有限公司","province":"浙江","city":"金华市","district":"义乌市","address":"义乌振鑫汽车修理店义乌市江东中路248号义乌, ZJ 322000","phone":"0579-85458880"},
                {"dealer":"河南福孚石化贸易有限公司","province":"河南","city":"信阳市","district":"光山县","address":"光山中德名车快修养护中心信阳市光山县三环路金帝大酒店正对面（三环路与牌坊路交叉口向南20米）信阳, HE 465450","phone":"18637615232"},
                {"dealer":"四川鼎力石化有限公司","province":"四川","city":"达州市","district":"通川区","address":"达州市麒润汽车维修服务有限公司四川省达州市通川区，西外新区，西苑佳居，四幢2、3、4号门市部达州, SC 0","phone":"13778330567"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"虎门镇","address":"东莞市虎门威凯汽修厂东莞市虎门北栅高速路口东莞, GD 523000","phone":"0769-85151998"},
                {"dealer":"唐山金万利商贸有限公司","province":"河北","city":"唐山市","district":"滦南县","address":"唐山市滦南县奔城京唐进口汽车修理厂河北省唐山市滦南县北环路兆才大街西段唐山, HB 64400","phone":"0315-4168139"},
                {"dealer":"赤峰汇昌丰商贸有限责任公司","province":"内蒙古自治区","city":"兴安盟","district":"乌兰浩特市","address":"晓坤润滑油经销部内蒙古省兴安盟乌兰浩特市白音路内蒙古, NM 137400","phone":"15048280666"},
                {"dealer":"宜昌凯旋汽配有限公司","province":"湖北","city":"宜昌市","district":"五峰土家族自治县","address":"五峰渔关钟华汽车修理厂湖北省五峰渔洋关镇曹家坪路150号宜昌, HU 443400","phone":"0717-5758908"},
                {"dealer":"徐水县长青商贸有限公司","province":"河北","city":"保定市","district":"定州市","address":"定州安讯汽车服务中心定州市中兴中路与自来佛街交叉口定州, HB 71000","phone":"13070548861"},
                {"dealer":"青海新孚商贸有限公司","province":"青海","city":"海西蒙古族藏族自治州","district":"格尔木市","address":"车虫汽车养护中心青海省格尔木市黄河中路45号格尔木, QH 816000","phone":"13369792828"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"保山市","district":"隆阳区","address":"保山嘉孚汽车维修服务有限公司云南省保山市隆阳区兰城路北段保山, YN 678000","phone":"0875-2239288"},
                {"dealer":"浙江全盛孚化工有限公司","province":"浙江","city":"湖州市","district":"南浔区","address":"新漆天汽车维修服务中心湖州市南浔区旧馆镇大桥路潘家庄小区对面湖州, ZJ 310022","phone":"0571-3519200 "},
                {"dealer":"杭州佐森石油化工有限公司","province":"浙江","city":"杭州市","district":"江干区","address":"杭州沃通汽车维修有限公司浙江省杭州市江干区俞章路132号杭州, ZJ 310022","phone":"0571-88882228"},
                {"dealer":"上海拉凯润滑油有限公司","province":"上海","city":"上海市","district":"浦东新区","address":"博帅汽车生活馆上海市浦东新区云台路804号上海, SH 0","phone":"13701782872"},
                {"dealer":"北京瑞兆呈祥商贸有限公司","province":"北京","city":"北京市","district":"房山区","address":"北京万通汽车维修服务有限公司北京房山良乡太平庄村建材市场11-13号北京, BJ 100000","phone":"010-89352039"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"大理白族自治州","district":"大理市","address":"大理道达车养护中心云南省大理市下关苍山东路326-328大理, YN 671000","phone":"0872-2323532"},
                {"dealer":"海丰县叁盛贸易有限公司","province":"广东","city":"汕尾市","district":"海丰县","address":"叁盛汽车快修维护中心汕尾市海丰县红城大道西中华鹏大酒店隔壁汕尾, GD 516400","phone":"0660-6681168"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"东城区","address":"酷驰汽修东莞市东城区中信阳光澳园正门A13-A17铺东莞, GD 523000","phone":"0769-23052323"},
                {"dealer":"大连远东高级润滑油经销有限公司","province":"辽宁","city":"大连市","district":"甘井子区","address":"大连安达信汽车服务中心姚家路4-10号大连, LN 116000","phone":"0411-86883377"},
                {"dealer":"常州市振勇润滑油有限公司","province":"江苏","city":"常州市","district":"钟楼区","address":"常州市东方恒安汽车服务有限公司常州市横山桥镇省庄村常州, JS 213000","phone":"0519-88609777"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"四平市","district":"伊通满族自治县","address":"伊通朋金源汽车养护店伊通县河北大路1019号伊通, JL 130700","phone":"0434-4233080"},
                {"dealer":"无锡市安润商贸有限公司","province":"江苏","city":"无锡市","district":"宜兴市","address":"天平汽车维修部宜兴市张诸镇西环路88号宜兴, JS 214231","phone":"13739110233"},
                {"dealer":"贰仟家汽车服务股份有限公司","province":"河南","city":"郑州市","district":"金水区","address":"郑州开元汽车维修站河南省郑州市金水区花园路与三全路向西500米路南（三全路89号东岸尚景郑州, HE 450000","phone":"18638588562"},
                {"dealer":"唐山金万利商贸有限公司","province":"河北","city":"唐山市","district":"路南区","address":"唐山跃华汽车快保店河北省唐山市路南区光明路与南新道交叉路口唐山, HB 63000","phone":"0315-2331440"},
                {"dealer":"天津市汇高世纪商贸有限公司","province":"河北","city":"廊坊市","district":"三河市","address":"三河市途博汽车服务有限责任公司河北省廊坊市三河市燕郊开发区神威北路525号三河, TJ 65201","phone":"13630670733"},
                {"dealer":"哈尔滨华隆伟业经贸有限公司","province":"黑龙江","city":"双鸭山市","district":"宝清县","address":"宝清运通修理部黑龙江省双鸭山市宝清县建设街90号晟业物流二期洗车中心2号双鸭山, HL 155600","phone":"13846934234\n"},
                {"dealer":"内蒙古海隆润滑技术有限责任公司","province":"内蒙古","city":"二连浩特","district":"0","address":"友奕汽车养护中心内蒙古二连浩特友谊南路肯特街路北汇丰宾馆楼下二连浩特, NM 12600","phone":"#N/A"},
                {"dealer":"大同洪达实业有限责任公司","province":"山西","city":"朔州市","district":"应县","address":"朔州市应县生平交通汽配维修中心朔州市应县应山路路北200米朔州, SA 37600","phone":"0349-5035399"},
                {"dealer":"包头市鹿孚物资有限责任公司","province":"内蒙古自治区","city":"包头市","district":"九原区","address":"包头市鹿孚物资有限责任公司内蒙古包头市九原区哈屯高勒路尹六窑子村25号底店包头, NM 14040","phone":"18647207370"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"辽源市","district":"龙山区","address":"辽源美孚1号车养护店辽源市龙山区华典58号楼辽源, JL 136200","phone":"13766021977"},
                {"dealer":"安徽狮远商贸有限公司","province":"安徽","city":"铜陵市","district":"狮子山区","address":"铜陵市狮子山区和瑞车行安徽省铜陵市狮子山区国际汽车城B区4栋17-23号铜陵, AH 244000","phone":"0562-2620999"},
                {"dealer":"武汉厚诚贸易有限公司","province":"湖北","city":"孝感市","district":"孝南区","address":"孝感市安兴达汽修服务有限公司孝感市航空路147-号孝感, HU 432000","phone":"13871903336"},
                {"dealer":"宁波市华达石化有限公司","province":"浙江","city":"宁波市","district":"慈溪市","address":"永诚汽车快修慈溪市西二环北路393／395号宁波, ZJ 315000","phone":"15869507781"},
                {"dealer":"泉州美联贸易有限公司","province":"福建","city":"泉州市","district":"丰泽区","address":"开元汽车维修有限公司福建省泉州市丰泽区城东街道路黄金大大厦（冠亚凯旋门斜对面）泉州, FJ 362100","phone":"0595-22099568"},
                {"dealer":"上海拉凯润滑油有限公司","province":"上海","city":"上海市","district":"虹口区","address":"上海徽祥汽服务有限公司上海市虹口区宝安路35号上海, SH 201608","phone":"13564605831"},
                {"dealer":"河南福孚石化贸易有限公司","province":"河南","city":"平顶山市","district":"汝州市","address":"汝州市恒驰源汽车维修养护中心汝州市东环路广成路交叉口西南角平顶山, HE 0","phone":"0375-6021698"},
                {"dealer":"宁波市华达石化有限公司","province":"浙江","city":"宁波市","district":"北仑区","address":"路捷峰行一站式汽车维修服务宁波市北仑区新碶松花江路406号宁波, ZJ 315000","phone":"13186850708"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"虎门镇","address":"宏发名车维修中心东莞市虎门镇南栅管理区平冈村路口即南苑学校对面东莞, GD 523000","phone":"13922910992"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"青岛市","district":"崂山区","address":"青岛华宝之星汽车服务有限公司山东省青岛市辽阳东路金华锦爱丁堡小区西墙外青岛, SD 266000","phone":"13305320998"},
                {"dealer":"北京市安惠汽车配件有限公司","province":"北京","city":"北京市","district":"朝阳区","address":"北京通达远汽车修理服务有限公司朝阳区豆各庄绿丰路2号北京, BJ 0","phone":"010-87356537"},
                {"dealer":"杭州佐森石油化工有限公司","province":"浙江","city":"杭州市","district":"萧山区","address":"保利汽车维修养护中心杭州市滨江区浦沿街道东冠路（东冠农贸市场对面）杭州, ZJ 0","phone":"0571-86633699"},
                {"dealer":"芜湖润孚商贸有限公司","province":"安徽","city":"芜湖市","district":"无为县","address":"美途伟达汽车维修服务中心（五分店）天门山东路莲塘新村对面芜湖, AH 241000","phone":"18055386660"},
                {"dealer":"宜昌凯旋汽配有限公司","province":"湖北","city":"宜昌市","district":"伍家岗区","address":"宜昌泰富汽车服务有限公司宜昌市夷陵路358号宜昌, HU 443001","phone":"0717-6526660"},
                {"dealer":"浙江全盛孚化工有限公司","province":"浙江","city":"杭州市","district":"富阳市","address":"富阳洗乐门一站式汽车维修服务杭州富阳市公园路38号杭州, ZJ 311400","phone":"13575792188"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"闵行区","address":"上海程安汽车修理有限公司虹梅南路1258弄125号上海, SH 0","phone":"15902110263"},
                {"dealer":"常州市振勇润滑油有限公司","province":"江苏","city":"常州市","district":"钟楼区","address":"常州德驰名车维修有限公司常州市虹西中路常州, JS 213001","phone":"0519-83717025"},
                {"dealer":"重庆新星海贸易有限公司","province":"重庆","city":"重庆市","district":"江北区","address":"迪奔汽车维修专业店渝北区天山大道西段39号1-119号重庆, CQ 400121","phone":"15923358163"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"大理白族自治州","district":"宾川县","address":"大理宾川风骋汽修云南省大理州宾川县金牛镇佛都路上段（月牙山村路口）大理, YN 0","phone":"0872-7143113"},
                {"dealer":"江阴市润中润滑油有限公司","province":"江苏","city":"无锡市","district":"江阴市","address":"江阴市凯润汽车销售有限公司江阴石庄东横街66号江阴, JS 214400","phone":"0510-86668886"},
                {"dealer":"南通新长江润滑油有限公司","province":"江苏","city":"南通市","district":"如皋市","address":"南通金泰汽车技术服务有限公司如皋市如城镇兴园路28号如皋, JS 0","phone":"0513-87330199"},
                {"dealer":"淮安市华孚润滑油有限公司","province":"江苏","city":"淮安市","district":"清河区","address":"淮安市隆达汽车修理厂淮安市健康东路8号，万达广场西侧对面淮安, JS 223001","phone":"15351700777"},
                {"dealer":"赤峰汇昌丰商贸有限责任公司","province":"内蒙古自治区","city":"呼伦贝尔市","district":"海拉尔区","address":"呼伦贝尔市博纳商贸有限公司呼伦贝尔市海拉尔区尼尔基路77号呼伦贝尔, NM 21000","phone":"4708202306"},
                {"dealer":"沧州市瑞昌隆商贸有限公司","province":"河北","city":"沧州市","district":"运河区","address":"百车百顺汽车保养快修店沧州市开元南大道与解放西路交叉口沧州, HB 61000","phone":"0317-2062555"},
                {"dealer":"衢州鼎润贸易有限公司","province":"浙江","city":"衢州市","district":"开化县","address":"开化县开达汽车修理厂衢州市开化县城关镇桃溪路3号衢州, ZJ 324300","phone":"13587112999"},
                {"dealer":"南京美润贸易有限公司","province":"江苏","city":"南京市","district":"建邺区","address":"南京新万国汽车服务中心南京市江东中路42号-17南京, JS 210000","phone":"13382002577"},
                {"dealer":"广西桂孚石化有限公司","province":"广西壮族自治区","city":"贺州市","district":"八步区","address":"广西贺州市满辉贸易有限公司广西贺州市石凉亭红绿灯往莲塘方向400米贺州, GX 542800","phone":"0774-5219828"},
                {"dealer":"柳州市埃孚特润滑油有限责任公司","province":"广西壮族自治区","city":"桂林市","district":"七星区","address":"桂林万安汽车销售服务有限公司桂林市七星区东环路桂林三宝对面桂林, GX 541000","phone":"0"},
                {"dealer":"重庆新星海贸易有限公司","province":"重庆","city":"重庆市","district":"永川区","address":"领航汽车会所重庆市永川区昌州大道199号重庆, CQ 402160","phone":"18602365211"},
                {"dealer":"重庆新星海贸易有限公司","province":"重庆","city":"重庆市","district":"九龙坡区","address":"佳腾汽车维修站重庆市九龙坡区直港大道天星路3、4号重庆, CQ 400051","phone":"023-68158067"},
                {"dealer":"无锡市安润商贸有限公司","province":"江苏","city":"无锡市","district":"滨湖区","address":"无锡市顺鼎汽车维修有限公司无锡市滨湖区胡埭镇宏翔中心路50号无锡, JS 214161","phone":"13806177961"},
                {"dealer":"大同洪达实业有限责任公司","province":"山西","city":"大同市","district":"左云县","address":"左云县锦瑞汽车修理中心大同市左云县北环路丁字路口西侧50米大同, SA 37100","phone":"13028098777"},
                {"dealer":"温州强润石化有限公司","province":"浙江","city":"温州市","district":"永嘉县","address":"永嘉县岩头镇季林勇汽车快修服务部永嘉县岩头芙蓉下新村路口温州, ZJ 325000","phone":"0577-67156261"},
                {"dealer":"南京美润贸易有限公司","province":"江苏","city":"南京市","district":"六合区","address":"南京瑞腾汽车维修有限公司南京市大厂杨新路38号南京, JS 210044","phone":"025-57023815"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"昆明市","district":"西山区","address":"昆明奔宇汽车维修服务有限公司昆明市西三环华苑路昆明, YN 650000","phone":"0871-65524943"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"青岛市","district":"市南区","address":"青岛鑫盛顺达汽车服务有限公司山东省青岛市市南区珠海路1号（东部市立医院后门东行100米院内）青岛, SD 266000","phone":"13356867877"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"长春市","district":"南关区","address":"长春晨辉汽修长春市净月区彩云街1001号长春, JL 130000","phone":"0431-84668166"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"长春市","district":"南关区","address":"长春晟通汽车服务有限公司长春市净月区世光路1822号长春, JL 130000","phone":"0431-82995678"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"四平市","district":"双辽市","address":"双辽万达汽车服务双辽市辽河路45号双辽, JL 136400","phone":"0434-7358999"},
                {"dealer":"汕头市恒孚贸易有限公司","province":"广东","city":"汕头市","district":"澄海区","address":"路力仕汽车服务中心 迎车港裕华1号养护店潮南区峡山镇北环大道与义西路交界处潮阳, GD 515144","phone":"0754-85873112,0754-86980068"},
                {"dealer":"山东省裕明商贸有限公司","province":"山东","city":"济南市","district":"市中区","address":"济南宝德汽车维修有限公司济南市市中区望月路186号济南, SD 250014","phone":"0531-86925555"},
                {"dealer":"宜昌凯旋汽配有限公司","province":"湖北","city":"宜昌市","district":"西陵区","address":"宜昌市西陵区鑫达汽修厂宜昌市西陵区夜明珠路66号宜昌, HU 443000","phone":"0717-6336187"},
                {"dealer":"南京美润贸易有限公司","province":"江苏","city":"南京市","district":"鼓楼区","address":"南京车盟汽车维修有限公司南京市鼓楼区古平岗24号南京, JS 210000","phone":"83774585"},
                {"dealer":"上海拉凯润滑油有限公司","province":"上海","city":"上海市","district":"闵行区","address":"上海美协汽车修理厂上海市闵行区友东路56号上海, SH 201199","phone":"13817231667"},
                {"dealer":"惠州市双和实业有限公司","province":"广东","city":"惠州市","district":"惠城区","address":"星河汽车维修服务部惠州市河南岸水岸花都二号楼15-18号惠州, GD 516002","phone":"0752-2513250"},
                {"dealer":"福州瑞元德贸易有限公司","province":"福建","city":"宁德市","district":"福鼎市","address":"福鼎宝力汽车维修福鼎市富阳路668号福鼎, FJ 355200","phone":"18150270177"},
                {"dealer":"泉州美联贸易有限公司","province":"福建","city":"泉州市","district":"晋江市","address":"晋江新长江汽车维修厂福建省晋江市安海镇安东园经济开发区泉州, FJ 362100","phone":"0595-85818333"},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"宝安区","address":"深圳市特力特汽车维修连锁机场后瑞店深圳市宝安区宝安大道后瑞村口深圳, GD 518000","phone":"18923844444"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"保山市","district":"腾冲县","address":"腾冲力源车养护中心腾冲县华园路延长线欢乐湖环岛健君医院对面保山, YN 0","phone":"13987055901"},
                {"dealer":"淮安市华孚润滑油有限公司","province":"江苏","city":"淮安市","district":"淮阴区","address":"淮安市新润汽车修理厂淮安市樱花小区门面房淮安, JS","phone":"15952396889"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"昆明市","district":"西山区","address":"昆明车管家汽车服务有限公司西山区富城车市28栋71-79号昆明, YN","phone":"#N/A"},
                {"dealer":"大连远东高级润滑油经销有限公司","province":"辽宁","city":"大连市","district":"庄河市","address":"鑫和汽车维修中心大连庄河市向阳路2段372号大连, LN 116400","phone":"0411-89873266"},
                {"dealer":"宁波市华达石化有限公司","province":"浙江","city":"宁波市","district":"象山县","address":"象山诚意汽车服务中心宁波象山工业园区丹河路39-49号宁波, ZJ","phone":"15356029261"},
                {"dealer":"宁波市华达石化有限公司","province":"浙江","city":"宁波市","district":"象山县","address":"宁波市鄞州美泊莱汽车服务中心宁波环城南路沈家村工业区1号宁波, ZJ","phone":"13906616182"},
                {"dealer":"珠海经济特区威盛贸易有限公司","province":"广东","city":"中山市","district":"沙溪","address":"德星汽车维护有限公司广东省中山市沙溪镇云汉村青云东路18号中山, GD","phone":"13527124888"},
                {"dealer":"武汉厚诚贸易有限公司","province":"湖北","city":"黄冈市","district":"黄州区","address":"黄冈市黄州金鼎汽车维修中心黄州区中环路宏鑫花园黄冈, HU 438000","phone":"18971705209"},
                {"dealer":"四川鼎力石化有限公司","province":"四川","city":"绵阳市","district":"游仙区","address":"绵阳万兴汽车维修中心绵阳市游仙区六里社区绵阳, SC","phone":"13808117371"},
                {"dealer":"浙江全盛孚化工有限公司","province":"浙江","city":"杭州市","district":"萧山区","address":"杭州鼎杰汽车修理有限公司杭州萧山区瓜沥镇八柯线杭州, ZJ","phone":"0571-83052799"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"青岛市","district":"李沧区","address":"青岛李沧万通汽车维修中心夏庄路174号丁青岛, SD","phone":"18953269882"},
                {"dealer":"淄博惠隆润滑油有限公司","province":"山东","city":"淄博市","district":"沂源县","address":"沂源宝民汽车养护服务中心沂源县富源路99号淄博, SD","phone":"13475583599"},
                {"dealer":"肇庆市新恒捷贸易有限公司","province":"广东","city":"清远市","district":"清新县","address":"清新县永利汽车维修有限公司广东省清远市清新区太和镇笔架路怡德居A栋118-120卡清远, GD 511800","phone":"0763-5857298"},
                {"dealer":"浙江全盛孚化工有限公司","province":"浙江","city":"杭州市","district":"萧山区","address":"杭州大振汽车维修服务有限公司杭州萧山区闻堰镇裴瑛路56号杭州, ZJ","phone":"13750862992"},
                {"dealer":"四川鼎力石化有限公司","province":"四川","city":"成都市","district":"双流县","address":"成都顺时针汽车服务有限公司成都市华阳二江路一段323号成都, SC","phone":"13088008667"},
                {"dealer":"汕头市恒孚贸易有限公司","province":"广东","city":"潮州市","district":"潮安县","address":"富豪汽车服务有限公司枫溪区潮汕公路古板头中段（即火车桥往汕头方向50米处）潮州, GD","phone":"18898833991"},
                {"dealer":"苏州市鸿祥经贸有限公司","province":"江苏","city":"苏州市","district":"0","address":"苏州车艺匠汽车服务有限公司苏州华山路和湘江路路口苏州, JS","phone":"0"},
                {"dealer":"重庆新星海贸易有限公司","province":"重庆","city":"重庆市","district":"渝北区","address":"嘉腾汽车渝北区松石支路24号重庆, CQ","phone":"13508334922"},
                {"dealer":"河南福孚石化贸易有限公司","province":"河南","city":"南阳市","district":"宛城区","address":"南阳马邦新动力汽车服务有限公司南阳市张衡路与独山大道交叉口向东300米路南丰源小区南阳, HE","phone":"15637744888"},
                {"dealer":"常州市振勇润滑油有限公司","province":"江苏","city":"常州市","district":"金坛市","address":"金坛市车杰汽车维修服务有限公司金坛市华阳北路99号常州, JS","phone":"0519-82582168"},
                {"dealer":"湖南海孚化工贸易有限公司","province":"湖南","city":"益阳市","district":"赫山区","address":"益阳市赫山区领域汽车会所益阳大道佳宁娜广场正对面益阳, HN","phone":"0737-3809555"},
                {"dealer":"南京美润贸易有限公司","province":"江苏","city":"南京市","district":"秦淮区","address":"南京亚柏兰汽车维修服务有限公司秦虹路8号南京, JS","phone":"13915963704"},
                {"dealer":"北京市安惠汽车配件有限公司","province":"河北","city":"张家口市","district":"桥东区","address":"安惠汽车快修保养河北省张家口市桥东区杨家坟东麓苑小区底商2号张家口, HB","phone":"13031979999"},
                {"dealer":"天津市汇高世纪商贸有限公司","province":"天津","city":"天津市","district":"西青区","address":"天津市安达汽车维修中心（佳顺二部）天津市南开区外环线辅路荷兰墅旁（津涞公路12号桥北）天津, TJ","phone":"13132039097"},
                {"dealer":"苏州市鸿祥经贸有限公司","province":"江苏","city":"苏州市","district":"吴中区","address":"苏州工业园区傲途汽车维修服务有限公司苏州工业园区苏虹中路399号苏州, JS","phone":"18606200015"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"浦东新区","address":"上海完美汽车服务有限公司博华路673号上海, SH","phone":"13761155601"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"浦东新区","address":"上海凌跃汽车服务有限公司金豫路22号上海, SH","phone":"13816268941"},
                {"dealer":"佛山市南海区大沥置达润滑油有限公司","province":"广东","city":"佛山市","district":"南海区","address":"顺洁亮汽车美容中心佛山市南海区海四路富泽商业城6号B2（即丽雅苑北区侧）佛山, GD 526600","phone":"0757-86266390"},
                {"dealer":"兰州大宇机械有限责任公司","province":"甘肃","city":"兰州市","district":"城关区","address":"兰州天行健汽车服务有限公司城关区排洪南路1000号兰州, GS 730050","phone":"13893349797"},
                {"dealer":"西安进和经贸有限责任公司","province":"陕西","city":"西安市","district":"未央区","address":"西安美车盛行汽车服务有限公司明光路26号西安, SX 710016","phone":"029-86457930"},
                {"dealer":"惠州市双和实业有限公司","province":"广东","city":"惠州市","district":"惠城区","address":"惠州市蓝波湾汽车服务中心惠州市惠城区水口镇大湖溪蓝波湾小区门口右侧100米惠州, GD 516001","phone":"13923630933"},
                {"dealer":"福州瑞元德贸易有限公司","province":"福建","city":"福州市","district":"连江县","address":"连江金升车业有限公司连江县敖江开发区104国道西侧（水岸御景对面）福州, FJ","phone":"13509386353"},
                {"dealer":"温州强润石化有限公司","province":"浙江","city":"温州市","district":"文成县","address":"文成县捷瑞汽车销售服务有限公司文成县樟台乡泉台（新56省道城关加油站对面）温州, ZJ","phone":"13868681711"},
                {"dealer":"赤峰汇昌丰商贸有限责任公司","province":"内蒙古自治区","city":"赤峰市","district":"巴林左旗","address":"巴林左旗美孚换油中心赤峰市巴林左旗林东镇皇城路北段赤峰, NM 25450","phone":"13484766661"},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"宝安区","address":"深圳市博斯卡汽车服务有限公司深圳市观澜白花社区富民大道富民花园C栋12-18号深圳, GD 518000","phone":"13802265959"},
                {"dealer":"唐山金万利商贸有限公司","province":"河北","city":"唐山市","district":"路南区","address":"唐山市路南卓越汽车修理厂河北省唐山市路南区西电路10号唐山, HB","phone":"0315-2325533"},
                {"dealer":"武汉厚诚贸易有限公司","province":"湖北","city":"武汉市","district":"青山区","address":"华星迪奥青山众奥店武汉市青山区建一南路武汉, HU 430000","phone":"18007157878"},
                {"dealer":"辽宁泓孚经贸股份有限公司","province":"辽宁","city":"沈阳市","district":"铁西区","address":"泓孚汽车服务中心沈阳市铁西区北二西路26号（瑞盛国际汽配城36栋4门）沈阳, LN 110026","phone":"024-25513399"},
                {"dealer":"西安进和经贸有限责任公司","province":"陕西","city":"西安市","district":"雁塔区","address":"新伯乐汽车服务有限公司高新六路北口向北50米西安, SX 710065","phone":"029-81263738"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"昆明市","district":"官渡区","address":"昆明云首汽车修理厂官渡区云秀路439号昆明, YN","phone":"13888526748"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"昆明市","district":"官渡区","address":"昆明邦尼森3S名车维修中心经开区俊信国际汽配城B4幢S1-S2号昆明, YN","phone":"13987146346"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"长春市","district":"南关区","address":"长春市博岳汽车维修服务有限公司长春市岳阳街58号长春, JL","phone":"0431-81348777"},
                {"dealer":"无锡市安润商贸有限公司","province":"江苏","city":"无锡市","district":"宜兴市","address":"宜兴市佳恒汽车服务有限公司宜兴市广厦汽车城宜兴, JS","phone":"13901535266"},
                {"dealer":"宁波市华达石化有限公司","province":"浙江","city":"宁波市","district":"慈溪市","address":"慈溪启邦汽车修理厂慈溪掌起镇坏城南路811-819号宁波, ZJ","phone":"13071913827\n"},
                {"dealer":"宁波市华达石化有限公司","province":"浙江","city":"宁波市","district":"海曙区","address":"君途汽车美容会所宁波环城南路西段326--330号宁波, ZJ","phone":"13906688182"},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"宝安区","address":"深圳市富利堡汽车服务有限公司深圳市宝安区观澜上坑社区牛角龙工业区天润工业园宿舍2一楼东侧深圳, GD 518000","phone":"0755-28088213"},
                {"dealer":"韶关市三都精细化工有限公司","province":"广东","city":"韶关市","district":"浈江区","address":"粤兴孚汽车养护中心韶关市浈江区韶塘路佛子冲林场韶关, GD 512023","phone":"13927887922"},
                {"dealer":"芜湖润孚商贸有限公司","province":"安徽","city":"芜湖市","district":"镜湖区","address":"芜湖市立可靓汽车服务中心银湖中路12号（原金色阳光）芜湖, AH","phone":"0553-3872586"},
                {"dealer":"天津市汇高世纪商贸有限公司","province":"河北","city":"廊坊市","district":"三河市","address":"河北省三河市中岳达汽车维修中心河北省三河市燕郊开发区燕灵路329号（民政学院东门斜对面）三河, HB","phone":"18632691611"},
                {"dealer":"浙江全盛孚化工有限公司","province":"浙江","city":"杭州市","district":"余杭区","address":"杭州路扬汽车维修有限公司杭州市余杭区仓前镇仓兴街295号杭州, ZJ","phone":"15888893133"},
                {"dealer":"山东省裕明商贸有限公司","province":"山东","city":"济南市","district":"槐荫区","address":"济南崇德汽车维修公司济南市经十西路3322号济南, SD","phone":"0531-85966060"},
                {"dealer":"芜湖润孚商贸有限公司","province":"安徽","city":"宣城市","district":"广德县","address":"广德县嘉成汽车快修广德县汽配维修市场内133-137号宣城, AH","phone":"13856309951"},
                {"dealer":"芜湖润孚商贸有限公司","province":"安徽","city":"芜湖市","district":"鸠江区","address":"芜湖奥旗汽车维修服务中心鸠江区清水街道春江路停车场芜湖, AH","phone":"18655369908"},
                {"dealer":"武汉厚诚贸易有限公司","province":"湖北","city":"武汉市","district":"洪山区","address":"新风彩汽车服务中心洪山区文治街南湖雅园门面武汉, HU 430000","phone":"18986027188"},
                {"dealer":"沧州市瑞昌隆商贸有限公司","province":"河北","city":"沧州市","district":"泊头市","address":"泊头市途安汽车服务中心泊头市胜利东路1号沧州, HB","phone":"0317-8285388"},
                {"dealer":"重庆日丰商贸有限公司","province":"重庆","city":"重庆","district":"九龙坡","address":"重庆伍合全吉汽车服务有限公司重庆市九龙坡区创业大道111号重庆, CQ","phone":"13708398298"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"怒江州","district":"泸水","address":"怒江州顺发润滑油经营部泸水县江西老干村庄房路96号怒江州, YN","phone":"0886-3630367"},
                {"dealer":"十堰东峻油品有限公司","province":"湖北","city":"襄阳市","district":"襄城区","address":"襄阳鑫自强汽车维修服务有限公司环城东路23号襄阳, HU 441000","phone":"0710-3628770"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"青岛市","district":"李沧区","address":"青岛中方汽车服务有限公司青岛市京口路157号青岛, SD","phone":"13376399001"},
                {"dealer":"广西桂孚石化有限公司","province":"广西壮族自治区","city":"钦州市","district":"钦南区","address":"广西钦州市钦州港润滑100服务部（金华店）钦州市钦州港经济技术开发区海丽街3号钦州, GX 535000","phone":"0777-3881234"},
                {"dealer":"惠州市双和实业有限公司","province":"广东","city":"惠州市","district":"惠城区","address":"兴时代汽车生活（荷兰水乡店）惠州市惠城区荷兰水乡环岛二路一期惠州, GD 516001","phone":"13286282018"},
                {"dealer":"南京美润贸易有限公司","province":"江苏","city":"南京市","district":"栖霞区","address":"南京苏星汽车销售有限公司南京迈皋桥东井村48号南京, JS","phone":"13451816696"},
                {"dealer":"衢州鼎润贸易有限公司","province":"浙江","city":"衢州市","district":"柯城区","address":"衢州市德众汽车修理有限公司浙江衢州市柯城区府东街766号衢州, ZJ","phone":"13505700228"},
                {"dealer":"镇江美润贸易有限公司","province":"江苏","city":"镇江市","district":"京口区","address":"万福汽车修理镇江市丁卯桥路四季经典28幢108室镇江, JS","phone":"18052877772"},
                {"dealer":"汕头市恒孚贸易有限公司","province":"广东","city":"揭阳市","district":"榕城区","address":"名阳汽修厂揭阳东山区美阳路卢前停车场西门揭阳, GD","phone":"13822966411"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"荔湾区","address":"奔马欧洲名车维修中心芳村大道东31号广州, GD 510000","phone":"020-81592238"},
                {"dealer":"衢州鼎润贸易有限公司","province":"浙江","city":"衢州市","district":"柯城区","address":"衢州市文富汽车修理厂衢州市柯城区建新路19号衢州, ZJ","phone":"13705709418"},
                {"dealer":"淄博惠隆润滑油有限公司","province":"山东","city":"淄博市","district":"临淄区","address":"临淄中隆汽车服务中心淄博市临淄区一诺路2666号淄博, SD","phone":"18678231922"},
                {"dealer":"重庆新星海贸易有限公司","province":"重庆","city":"重庆市","district":"永川区","address":"永立汽车快修永川区人民东路98号重庆, CQ","phone":"18602365211"},
                {"dealer":"长沙车信汽车用品有限公司","province":"湖南","city":"长沙市","district":"开福区","address":"长沙市开福区旺腾汽车修理厂长沙市开福区秀峰街道大塘基社区集镇建房106号1栋长沙, HN","phone":"13787078190"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"辽源市","district":"东丰县","address":"吉林省东丰东顺换油中心东丰县药业大街419号辽源, JL","phone":"0437-6222778"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"天河区","address":"众龙驰汽车维修服务有限公司广州市天河区龙怡路91号3号楼自编8号广州, GD 510000","phone":"020-38488757"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"长白山","district":"二道白河","address":"吉林省日鑫汽车维修服务有限公司吉林省安图县二道白河镇白山街42号与参花街交汇长白山, JL","phone":"13304468111"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"延吉","district":"敦化","address":"敦化维信汽车维修服务有限公司吉林省敦化市丹江街东丹小区凤凰城A13号楼延吉, JL","phone":"0433-6301728"},
                {"dealer":"泉州美联贸易有限公司","province":"福建","city":"泉州市","district":"惠安县","address":"大运汽车服务中心泉州市惠安县世纪大道惠安体育馆对面泉州, FJ","phone":"13788838917"},
                {"dealer":"天津市泰拓科工贸有限公司","province":"天津","city":"天津市","district":"滨海新区","address":"繁荣汽车维修中心天津滨海新区滨海大道与东环路交口天津, TJ","phone":"13820233488"},
                {"dealer":"北京市安惠汽车配件有限公司","province":"北京","city":"北京市","district":"朝阳区","address":"北京和顺德隆汽车装饰服务有限公司(链车30快捷汽车服务）北京市朝阳区青年路将台洼甲80号北京, BJ","phone":"010-64372914"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"日照市","district":"东港区","address":"日照亚欧美汽车俱乐部日照市高新二路173号日照, SD","phone":"13306335167"},
                {"dealer":"内蒙古海隆润滑技术有限责任公司","province":"内蒙古自治区","city":"乌兰察布市","district":"集宁区","address":"乌市安捷车养护中心乌兰察布市集宁新区金泰苑小区（西门向北50米路东）底商5号6号乌兰察布, NM 12000","phone":"13947459595"},
                {"dealer":"厦门鸿铎贸易有限公司","province":"福建","city":"厦门市","district":"翔安区","address":"厦门誉鼎驰臻汽车销售服务有限公司厦门市翔安区新店镇新兴街116号之7厦门, FJ","phone":"15160731777"},
                {"dealer":"贵州德鸿孚贸易有限公司","province":"贵州","city":"黔南布依族苗族自治州","district":"瓮安县","address":"车马轩汽车服务有限公司贵州省瓮安县外环路检车场黔南, GZ 550400","phone":"15286286688"},
                {"dealer":"贰仟家汽车服务股份有限公司","province":"河南","city":"郑州市","district":"中原区","address":"郑州市高新区博世维修站河南省郑州市高新区龙柏里1号郑州, HE","phone":"13938439966"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"寮步镇","address":"东莞市寮步车乐福汽车服务部东莞市寮步镇石大路27号东莞, GD 523000","phone":"0769-82876698"},
                {"dealer":"河南福孚石化贸易有限公司","province":"河南","city":"商丘市","district":"永城市","address":"永城市源林汽车维修服务中心河南省永城市东城区欧亚路与民生街交叉口北200米永城, HE","phone":"13849662395"},
                {"dealer":"安徽狮远商贸有限公司","province":"安徽","city":"池州市","district":"贵池区","address":"华鑫轿车维修服务中心池州市石台路490号池州, AH","phone":"18956681681"},
                {"dealer":"安徽狮远商贸有限公司","province":"安徽","city":"安庆市","district":"桐城市","address":"桐城市长达汽车贸易服务有限公司桐城市同安南路272号桐城, AH","phone":"15856543467"},
                {"dealer":"肇庆市新恒捷贸易有限公司","province":"广东","city":"肇庆市","district":"广宁县","address":"广宁县德诚汽车服务有限公司广东省肇庆市广宁县南街镇本策工业园(县城往东乡5公里处)肇庆, GD 526300","phone":"0758-8651883"},
                {"dealer":"北京市安惠汽车配件有限公司","province":"北京","city":"北京市","district":"丰台区","address":"北京运通宝盈汽车服务有限公司北京市丰台区方庄芳古园3区1号-1北京, BJ","phone":"13910960630"},
                {"dealer":"福州瑞元德贸易有限公司","province":"福建","city":"福州市","district":"晋安区","address":"福建省隆汇汽车服务有限公司福建省福州市新店镇秀峰路地铁口旁福州, FJ","phone":"18650360609"},
                {"dealer":"武汉厚诚贸易有限公司","province":"湖北","city":"武汉市","district":"洪山区","address":"骏马汽车修理行武汉市洪山区文化大道武汉, HU 430000","phone":"15827189123"},
                {"dealer":"福州嘉瑞源商贸有限公司","province":"福建","city":"福州市","district":"闽清县","address":"闽清县云龙乡文华汽车养护中心闽清县云龙乡华伦汽车俱乐部福州, FJ","phone":"13067208206\n"},
                {"dealer":"石家庄市联英商贸有限公司","province":"河北","city":"石家庄市","district":"长安区","address":"石家庄雷博汽车会所汽车服务有限公司石家庄东二环与中山路西南角石家庄, HB","phone":"18903215896"},
                {"dealer":"石家庄市联英商贸有限公司","province":"河北","city":"邯郸市","district":"峰峰矿区","address":"邯郸峰峰飞跃养护中心峰峰矿区太行东路与鼓山中路交叉口北行500米路东邯郸, HB","phone":"15830061005"},
                {"dealer":"石家庄市冀中众力汽车贸易有限公司","province":"河北","city":"石家庄市","district":"桥西区","address":"石家庄市桥西区闻鑫养车行石家庄市桥西区新石北路A2--3号石家庄, HB","phone":"18630197759"},
                {"dealer":"佛山市顺德区容桂新达商贸有限公司","province":"广东","city":"佛山市","district":"顺德区","address":"佛山市金孚汽车维修有限公司广东省佛山市顺德区容桂红旗中路东怡雅苑东区10号佛山, GD 528000","phone":"0757-28386121"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"昆明市","district":"官渡区","address":"昆明市景赛汽车维修连锁昆明市南疆汽车服务广场22栋74-78号昆明, YN","phone":"13888788432"},
                {"dealer":"天津市汇高世纪商贸有限公司","province":"天津","city":"天津市","district":"静海县","address":"百车百顺汽车养护中心（丰达汽车维修分店）天津市静海县静海镇刘官庄和睦西里1排16号（胜利大街与北华路交口）天津, TJ","phone":"18502613797"},
                {"dealer":"北京瑞兆呈祥商贸有限公司","province":"北京","city":"北京市","district":"昌平区","address":"北京德锐博翔汽车服务有限公司北京市朝阳区立汤路立水桥东方郁金香西侧大院北京, BJ 100000","phone":"13911933910"},
                {"dealer":"辽宁众信商贸有限公司","province":"辽宁","city":"沈阳市","district":"铁西区","address":"辽宁众信汽车换油养护中心沈阳市铁西区齐贤北街金地名京20号楼4甲1 网店4门沈阳, LN 110020","phone":"13700141777"},
                {"dealer":"大连远东高级润滑油经销有限公司","province":"辽宁","city":"大连市","district":"西岗区","address":"大连市西岗区国富汽车服务中心大连市西岗区市场街118号大连, LN 116000","phone":"13591177880"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"浦东新区","address":"上海齐开汽车维修服务有限公司浦东新区大团镇南芦公路1258号上海, SH","phone":"13482693073"},
                {"dealer":"江苏美福润滑油有限公司","province":"江苏","city":"连云港市","district":"新浦区","address":"连云港祥珲汽车用品有限公司凌州路8号 新海建材城内连云港, JS","phone":"13003470468"},
                {"dealer":"肇庆市新恒捷贸易有限公司","province":"广东","city":"肇庆市","district":"德庆县","address":"德庆县德庆港德进口汽车修配厂有限公司广东省肇庆市德庆县城北东路22号肇庆, GD 526600","phone":"0758-7732198"},
                {"dealer":"哈尔滨华隆伟业经贸有限公司","province":"黑龙江","city":"双鸭山市","district":"尖山区","address":"双鸭山新世纪车养护黑龙江省双鸭山市尖山区铁西路 星运河畔 A 栋2号(市消防队南侧）双鸭山, HL","phone":"0469-4197444  "},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"宝安区","address":"深圳市新华旺汽车美容服务中心深圳市龙华新区大浪华昌路217号深圳, GD 518000","phone":"13725541018"},
                {"dealer":"淄博惠隆润滑油有限公司","province":"山东","city":"淄博市","district":"博山区","address":"博山金孚润汽车服务中心淄博市博山区北山路西首80号淄博, SD","phone":"13723997434"},
                {"dealer":"山东省裕明商贸有限公司","province":"山东","city":"济南市","district":"天桥区","address":"济南速驰汽车服务有限公司济南市无影山路100号（与堤口路交叉口）济南, SD","phone":"15820001071"},
                {"dealer":"西安进和经贸有限责任公司","province":"陕西","city":"西安市","district":"阎良区","address":"西安市阎良区木林森汽车养护中心阎良区前进东路18号西安, SX 710089","phone":"13572596117"},
                {"dealer":"重庆新星海贸易有限公司","province":"重庆","city":"重庆市","district":"江津区","address":"古伦汽车服务中心江津区凤凰路琅山部队对面重庆, CQ","phone":"13609412626"},
                {"dealer":"肇庆市新恒捷贸易有限公司","province":"广东","city":"肇庆市","district":"端州区","address":"肇庆市端州区名扬车辆养护服务部（新元店）广东省肇庆市端州区新元西路新元花苑b6-b7栋首层06-10卡肇庆, GD 526040","phone":"0758-2733855"},
                {"dealer":"宜昌凯旋汽配有限公司","province":"湖北","city":"宜昌市","district":"当阳市","address":"当阳市玉阳途悦汽车护理服务部当阳市环城东路40号宜昌, HU 444100","phone":"13508607999"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"深圳市","district":"宝安区","address":"深圳市宝安区松岗现代汽车服务城深圳市宝安区松岗街道商业步行街A31栋102号深圳, GD 518105","phone":"0755-27085914"},
                {"dealer":"四川鼎力石化有限公司","province":"四川","city":"成都市","district":"郫县","address":"畅享汽车连锁-犀浦君印店成都市犀浦兴业北街258号成都, SC","phone":"028-87839502"},
                {"dealer":"广州市番禺松达贸易发展有限公司","province":"广东","city":"广州市","district":"番禺区","address":"骏壹一站式汽车服务部广州市番禺区大龙街番禺大道北1387号广州, GD","phone":"13434101777"},
                {"dealer":"金华市顺力石油化工有限公司","province":"浙江","city":"金华市","district":"永康市","address":"永康市宝捷汽车维修行永康市城南路1102号金华, ZJ","phone":"0579-87191288"},
                {"dealer":"嘉兴市诚信润滑油有限公司","province":"浙江","city":"嘉兴市","district":"秀洲区","address":"嘉兴市秀洲区新城街道鼎优汽车服务中心嘉兴市秀洲区中山名都绿洲商务楼s01-S02一楼嘉兴, ZJ","phone":"13605732707"},
                {"dealer":"赤峰汇昌丰商贸有限责任公司","province":"内蒙古自治区","city":"呼伦贝尔市","district":"阿荣旗","address":"晓刚高级汽车修配厂阿荣旗那吉镇滨河西街荣安香苑16号楼23号门市呼伦贝尔, NM 21000","phone":"13484709856"},
                {"dealer":"唐山金万利商贸有限公司","province":"河北","city":"唐山市","district":"丰润区","address":"唐山市丰润区庆鑫汽车修理厂唐山市丰润区燕山路燕南钢材市场B220号唐山, HB","phone":"0315-5636191"},
                {"dealer":"包头市鹿孚物资有限责任公司","province":"内蒙古自治区","city":"包头市","district":"青山区","address":"包头市广晟汽车快修养护中心包头市青山区厂前路南侧包头, NM 14030","phone":"13654848486"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"长春市","district":"二道区","address":"红星汽车维修服务中心长春市二道区临河街与海口路交汇处长春, JL","phone":"0431-84688898"},
                {"dealer":"赤峰汇昌丰商贸有限责任公司","province":"内蒙古自治区","city":"赤峰市","district":"敖汉旗","address":"腾尊轮胎养护店赤峰市敖汉旗新惠镇蒙中街南段赤峰, NM 24300","phone":"15049688886"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"威海市","district":"环翠区","address":"威海市车怡汽车维修有限公司威海市青岛中路88-4-5威海, SD","phone":"15266112788"},
                {"dealer":"大连远东高级润滑油经销有限公司","province":"辽宁","city":"大连市","district":"普兰店市","address":"普兰店万通普兰店市杨树房街道新星路68号普兰店, LN 116200","phone":"18640998355"},
                {"dealer":"宜昌凯旋汽配有限公司","province":"湖北","city":"恩施土家族苗族自治州","district":"利川市","address":"利川骏驰车饰界湖北省恩施州利川市腾龙大道29号（腾龙加油站对面）宜昌, HU 445400","phone":"152-72969399"},
                {"dealer":"十堰东峻油品有限公司","province":"湖北","city":"襄阳市","district":"樊城区","address":"襄阳鑫自强汽车维修服务公司长庆店长征路长庆巷长庆花园门面襄阳, HU 441000","phone":"13972099289"},
                {"dealer":"湖南海孚化工贸易有限公司","province":"湖南","city":"长沙市","district":"雨花区","address":"长沙雨花区瑞锦汽车维修养护中心长沙市雨花区圭塘大塘小区9栋1-3号门面长沙, HN","phone":"0731-86459478"},
                {"dealer":"武汉森美石化制品有限公司","province":"湖北","city":"荆州市","district":"洪湖市","address":"润顺一站式换油养护中心湖北省洪湖市新堤大道柏枝汽车城A111-114荆州, HU 433200","phone":"0716-2217177"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"潍坊市","district":"奎文区","address":"潍坊圣恒汽车服务有限公司潍坊市鸢飞路359号西樱香港汽配城2A01号潍坊, SD","phone":"15953608777"},
                {"dealer":"南京美润贸易有限公司","province":"江苏","city":"南京市","district":"六合区","address":"南京翔途汽车维修有限公司南京市六合区大厂和平中心村西楼门面房180-188号南京, JS","phone":"13357730668"},
                {"dealer":"青岛杜森商贸有限公司","province":"山东","city":"潍坊市","district":"奎文区","address":"潍坊驭行汽车服务中心潍坊市奎文区健康东街14278号67-1潍坊, SD","phone":"13864659639"},
                {"dealer":"济南天瑞润滑油销售有限公司","province":"山东","city":"济宁市","district":"邹城市","address":"邹城市亿恒汽车维修有限公司邹城市矿建西路366号邹城, SD","phone":"15365709888"},
                {"dealer":"烟台永升工贸经营有限公司","province":"山东","city":"威海市","district":"文登市","address":"文登区九奔汽车维修服务中心威海市文登区米山东路44-2-3-4威海, SD 264400","phone":"13963170009"},
                {"dealer":"南京美润贸易有限公司","province":"江苏","city":"南京市","district":"六合区","address":"南京捷运汽车服务有限公司南京市六合区新华路218号南京, JS","phone":"13952051888"},
                {"dealer":"安徽狮远商贸有限公司","province":"安徽","city":"铜陵市","district":"郊区","address":"铜陵万泰汽车服务有限公司铜陵市省汽贸南侧铜陵, AH","phone":"0562-2625066"},
                {"dealer":"广州市番禺松达贸易发展有限公司","province":"广东","city":"广州市","district":"番禺区","address":"一路发德国名车维修中心广州市番禺区南村镇里仁洞村立新路28号广州, GD","phone":"13802764056"},
                {"dealer":"重庆新星海贸易有限公司","province":"重庆","city":"重庆市","district":"南岸区","address":"嘉业汽车服务中心重庆市巴南区茶园城南家园中二路1号附349、350、351、352、353号重庆, CQ","phone":"13002351184"},
                {"dealer":"大同洪达实业有限责任公司","province":"山西","city":"大同市","district":"城区","address":"大同市富源隆实业有限责任公司大同市庞大国际汽车城A区08-11号大同, SA 37000","phone":"13935220001"},
                {"dealer":"贵州德鸿孚贸易有限公司","province":"贵州","city":"贵阳市","district":"清镇市","address":"清镇王进轮胎汽车养护中心贵州省清镇市庙儿山加油站旁贵阳, GZ 550000","phone":"13885086068"},
                {"dealer":"广州市腾孚化工有限公司","province":"广东","city":"广州市","district":"天河区","address":"广州康铃汽车服务有限公司吉山大淋岗9号广州, GD 510000","phone":"020-23361019"},
                {"dealer":"银川市宇成商贸有限公司","province":"内蒙古自治区","city":"乌海市","district":"海勃湾区","address":"海勃湾宏达进口汽车修理海勃湾海河南路（皓池检测站院内）乌海, NM 16000","phone":"13904732248"},
                {"dealer":"上海天孚汽车贸易有限公司","province":"上海","city":"上海市","district":"松江区","address":"上海车之音汽车维修服务有限公司松江区泗泾镇泗砖公路112号—116号上海, SH","phone":"13918552233"},
                {"dealer":"河南福孚石化贸易有限公司","province":"河南","city":"郑州市","district":"二七区","address":"豫涛博世汽车维修服务郑州市二七区嵩山路18号郑州, HE","phone":"13623862811"},
                {"dealer":"徐水县长青商贸有限公司","province":"河北","city":"保定市","district":"北市区","address":"保定中北车业保定市长城北大街保定, HB","phone":"15833338038"},
                {"dealer":"昆明景赛商贸有限公司","province":"云南","city":"曲靖市","district":"麒麟区","address":"曲靖翰池汽车养护中心麒麟区三江国际车立方市场C5栋曲靖, YN","phone":"13887473099"},
                {"dealer":"四川鼎力石化有限公司","province":"四川","city":"成都市","district":"青羊区","address":"车之新汽车美容养护中心成都市青羊区光华西三路168号成都, SC","phone":"13568824806"},
                {"dealer":"湖南海孚化工贸易有限公司","province":"湖南","city":"岳阳市","district":"岳阳楼区","address":"岳阳市岳阳楼区顺驰汽车服务中心岳阳市金鹗西路127号（岳阳市体育局一楼）岳阳, HN","phone":"730-8215666"},
                {"dealer":"福州瑞元德贸易有限公司","province":"福建","city":"福州市","district":"台江区","address":"福州车之友装潢护理中心台江区状元街99号汇福花园5-6号福州, FJ","phone":"13905919156"},
                {"dealer":"本溪海纳商贸有限公司","province":"辽宁","city":"本溪市","district":"本溪满族自治县","address":"本溪满族自治县惠溪汽车服务中心本溪满族自治县过境路98-75-20本溪, LN 117100","phone":"15141400948"},
                {"dealer":"本溪海纳商贸有限公司","province":"辽宁","city":"本溪市","district":"明山区","address":"本溪市明山区振远惠溪汽车服务中心本溪市明山区峪明路150栋1层8号本溪, LN 117000","phone":"024-44866166"},
                {"dealer":"哈尔滨华隆伟业经贸有限公司","province":"黑龙江","city":"绥化市","district":"望奎县","address":"望奎换油中心交通街88号(第三中学对面)绥化, HL","phone":"13614555596"},
                {"dealer":"大连远东高级润滑油经销有限公司","province":"辽宁","city":"大连市","district":"甘井子区","address":"大连亿轩汽车养护中心西南路亿丰汽车城大连, LN 116000","phone":"13352233002"},
                {"dealer":"吉林省中天化工经贸有限公司","province":"吉林","city":"四平市","district":"铁东区","address":"恒鑫元汽车服务养护中心吉林省四平市铁东区北102国道 北1马路四平, JL","phone":"0434-3517345"},
                {"dealer":"武汉厚诚贸易有限公司","province":"湖北","city":"武汉市","district":"江岸区","address":"武汉昊天汽车维修美容服务中心后湖大道特1号超凡物流门面武汉, HU 430000","phone":"13296665559"},
                {"dealer":"西安进和经贸有限责任公司","province":"陕西","city":"西安市","district":"临潼区","address":"临潼永刚汽修厂临潼区秦岭北路西安, SX 710600","phone":"13772178660"},
                {"dealer":"杭州佐森石油化工有限公司","province":"浙江","city":"绍兴市","district":"诸暨市","address":"诸暨市陶朱驰马汽车快修店诸暨市环城东路980号绍兴, ZJ","phone":"13857570889"},
                {"dealer":"山西超力贸易有限公司","province":"山西","city":"临汾市","district":"洪洞县","address":"洪洞县赵城镇通运汽修部洪洞县梗壁村牌楼处临汾, SA 41600","phone":"0357-6568200"},
                {"dealer":"营口锦昌实业有限公司","province":"辽宁","city":"盘锦市","district":"兴隆台区","address":"盘锦聚龙达汽车销售服务有限公司盘锦市兴隆台区赵家开发区工业街盘锦, LN 124010","phone":"13082297295"},
                {"dealer":"东莞市东孚石油化工有限公司","province":"广东","city":"东莞市","district":"长安镇","address":"东莞创捷汽车维修有限公司东莞市长安镇西安路45号东莞, GD 523000","phone":"13902605454"},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"福田区","address":"深圳市动力鹏汽车维修有限公司彩田分公司福田区彩田北路7026号深圳市源祥彩田加油站南侧深圳, GD 518000","phone":"13602632088"},
                {"dealer":"常州市振勇润滑油有限公司","province":"江苏","city":"常州市","district":"武进区","address":"常州宝星行汽车服务有限公司常州市武进二手车交易市场东南区2号楼 113-116常州, JS","phone":"0519-81182599"},
                {"dealer":"包头市蒙泰物贸有限责任公司","province":"内蒙古自治区","city":"鄂尔多斯市","district":"东胜区","address":"鄂尔多斯车道汽车服务有限公司鄂尔多斯市东胜区天骄北路摩力圣汇中石油加油站西鄂尔多斯, NM 17000","phone":"15204773131"},
                {"dealer":"珠海经济特区威盛贸易有限公司","province":"广东","city":"珠海市","district":"斗门区","address":"斗门区白蕉镇顺通汽车美容护理中心广东省珠海市斗门区白蕉镇真桥湖北路珠海, GD","phone":"0756-5611662"},
                {"dealer":"保定市广森商贸有限公司","province":"河北","city":"保定市","district":"定兴县","address":"定兴快特汽修保定市定兴县107国道黄金台红绿灯南行500米路东保定, HB","phone":"13663307544"},
                {"dealer":"深圳市粤鹏孚化工有限公司","province":"广东","city":"深圳市","district":"宝安区","address":"深圳市宝安区民治车臣邦汽车美容店深圳市龙华新区金地梅陇镇1期1栋深圳, GD 518000","phone":"13428960814"}];
            $.each(arrData,function(Manu){
                if (judgeObj('#selectProvince option', arrData[Manu]["province"]) == 0){
                    $('#selectProvince').append('<option>'+arrData[Manu]["province"]+'</option>')
                }
                $('#cont').append(
                    '<tr>' +
                    '<td>'+arrData[Manu]["dealer"]+'</td>'+
                    '<td>'+arrData[Manu]["province"]+'</td>'+
                    '<td>'+arrData[Manu]["city"]+'</td>'+
                    '<td>'+arrData[Manu]["district"]+'</td>'+
                    '<td>'+arrData[Manu]["address"]+'</td>'+
                    '<td>'+arrData[Manu]["phone"]+'</td>' +
                    '</tr>'
                )
            });
            
            $('#selectProvince').change(function(){
                $('#cont').empty();
                objInit('#selectCity');
                objInit('#selectDistrict');
                $('h2').replaceWith('<h2>' + $('#selectProvince option:selected').text() + '</h2>');
                $.each(arrData,function(Manu){
                    if($('#selectProvince option:selected').text()==arrData[Manu]["province"]){
                        if (judgeObj('#selectCity option', arrData[Manu]["city"]) == 0){
                            $('#selectCity').append('<option>'+arrData[Manu]["city"]+'</option>')
                        }
                        $('#cont').append(
                            '<tr>' +
                            '<td>'+arrData[Manu]["dealer"]+'</td>'+
                            '<td>'+arrData[Manu]["province"]+'</td>'+
                            '<td>'+arrData[Manu]["city"]+'</td>'+
                            '<td>'+arrData[Manu]["district"]+'</td>'+
                            '<td>'+arrData[Manu]["address"]+'</td>'+
                            '<td>'+arrData[Manu]["phone"]+'</td>' +
                            '</tr>'
                        )
                    }
                });
            });
            $('#selectCity').change(function(){
                objInit('#selectDistrict');
                $('#cont').empty();
                $('h2').replaceWith('<h2>' + $('#selectCity option:selected').text() + '</h2>');
                $.each(arrData,function(Manu){
                    if($('#selectCity option:selected').text()==arrData[Manu]["city"]){
                        if (judgeObj('#selectDistrict option', arrData[Manu]["district"]) == 0){
                            $('#selectDistrict').append('<option>'+arrData[Manu]["district"]+'</option>')
                        }
                        $('#cont').append(
                            '<tr>' +
                            '<td>'+arrData[Manu]["dealer"]+'</td>'+
                            '<td>'+arrData[Manu]["province"]+'</td>'+
                            '<td>'+arrData[Manu]["city"]+'</td>'+
                            '<td>'+arrData[Manu]["district"]+'</td>'+
                            '<td>'+arrData[Manu]["address"]+'</td>'+
                            '<td>'+arrData[Manu]["phone"]+'</td>' +
                            '</tr>'
                        )
                    }
                });
            });
            $('#selectDistrict').change(function () {
                $('#cont').empty();
                $('h2').replaceWith('<h2>' + $('#selectDistrict option:selected').text() + '</h2>');
                $.each(arrData,function (Manu) {
                    if ($('#selectDistrict option:selected').text()==arrData[Manu]["district"]){
                        $('#cont').append(
                            '<tr>' +
                            '<td>'+arrData[Manu]["dealer"]+'</td>'+
                            '<td>'+arrData[Manu]["province"]+'</td>'+
                            '<td>'+arrData[Manu]["city"]+'</td>'+
                            '<td>'+arrData[Manu]["district"]+'</td>'+
                            '<td>'+arrData[Manu]["address"]+'</td>'+
                            '<td>'+arrData[Manu]["phone"]+'</td>' +
                            '</tr>'
                        )
                    }
                })
            })
});